<template>
    <div>
        <div class="container home-content">
            <div class="row">
                <h1 class="title-text">Таунхаус у «Белых ключей»</h1><br>
            </div>
            <div class="row">
                <p>
                    Девять главных преимуществ Таунхауса у белых ключей:
                </p>
            </div>
        </div>
        <div class="container content-desc">
            <div class="row">
                <div class="block-desc">
                    <div class="desc">
                        <span></span>
                        <h3 class="title-desc">Отдельный вход</h3>
                        <p>
                            Приезжать домой становится приятней. <br>
                            Теперь вам не надо заходить в тёмный и <br>
                            грязный подъезд и ехать на лифте. Вас <br>
                            ждёт свой индивидуальный вход, перед <br>
                            которым на вашем участке сделано<br>
                            благоустройство. Это преимущество <br>
                            делает ваше жилище более <br>
                            индивидуальным и позволяет<br>
                            наслаждаться всеми плюсами отдельно <br>
                            стоящего дома.</p>
                    </div>
                    <div class="desc">
                        <span></span>
                        <h3 class="title-desc">
                            Собственный гараж +
                            индивидуальная парковка<br>
                            для автомобиля
                        </h3>
                        <p>
                            По статистике практически в каждой семье есть автомобиль. В нашем городе проблема парковки
                            автомобиля возле дома является особо острой уже несоколько лет. Поэтому наличие
                            индивидуального парковочного места или гаража - это актуальное решение для нашего города.
                            Теперь у вас всегда есть место для автомобиля и не надо платить за стоянку. Это особенно
                            удобно для большой семьи и её гостей.
                        </p>
                    </div>
                    <div class="desc">
                        <span></span>
                        <h3 class="title-desc">
                            Трёхуровневое расположение<br>
                            комнат
                        </h3>
                        <p>
                            Данное решение позволяет разделить дом на зоны, где каждый занимается своим делом или
                            отдыхает, не отвлекая других членов семьи. Основное время вы будете проводить на 2 этаже,
                            где располагаются гостиная и кухня. На третьем этаже располагаются спальни. Первый этаж
                            служит для технических помещений, гаража, сауны и комнаты для гостей. На каждом этаже
                            предусмотрен санузел, это удобно для большой семьи.
                        </p>
                    </div>
                    <div class="desc">
                        <span></span>
                        <h3 class="title-desc">
                            Придомовой участок, терраса
                        </h3>
                        <p>
                            Таунхаус - это больше, чем просто квартира. Здесь вы сможете приятно отдыхать летом на своём
                            придомовом участке или террасе, использовать не только жилую площадь, но и придомовую
                            территорию. Барбекю, посиделки с друзьями тёплым летним вечером - что может быть лучше?
                        </p>
                    </div>
                    <div class="desc hide-mobile">
                        <span></span>
                        <h3 class="title-desc">
                            Удобный застекленный<br>
                            балкон 1,5 метра в ширину
                        </h3>
                        <p>
                            Полноценно использовать балкон становится нормой. Размеры балкона позволяют поставить летний
                            стол и стулья, тренажёр или диван.
                        </p>
                    </div>
                    <div class="desc" :class="{'hide-mobile': !advantages}">
                        <span></span>
                        <h3 class="title-desc">
                            Центральное городское<br>
                            водоснабжение, канализация<br>
                            и электроэнергия
                        </h3>
                        <p>
                            Преимуществом городского таунхауса перед загородным домом безусловно является наличие всех
                            городских коммунальных сетей. Вам не надо беспокоиться о септиках или автономных
                            канализациях, не надо брать на себя расходы по их эксплуатации и риски, связанные с их
                            возможной поломкой. В таунхаусе у белых ключей за все коммуникации отвечают соответствующие
                            городские службы.
                        </p>
                    </div>
                    <div class="desc" :class="{'hide-mobile': !advantages}">
                        <span></span>
                        <h3 class="title-desc">
                            Автономное отопление и<br>
                            горячее водоснабжение на<br>
                            природном газе
                        </h3>
                        <p>
                            Природный газ является одним из самых экономичных источников энергии. Существенная экономия
                            на коммунальных платежах, индивидуальная настройка под себя, отсутствие проблем с
                            отключением горячей воды летом - всё это делает вашу жизнь комфортнее без дополнительных
                            затрат.
                        </p>
                    </div>
                    <div class="desc" :class="{'hide-mobile': !advantages}">
                        <span></span>
                        <h3 class="title-desc">
                            Возможность сделать<br>
                            индивидуальную планировку
                        </h3>
                        <p>
                            Таунхаус - это не только просторные комнаты, но и возможность перепланировать внутренние
                            перегородки под требования вашей семьи, чтобы сделать вашу жизнь и жизнь ваших любимых
                            максимально комфортной. Сформировать детскую комнату или сделать просторную студию - это
                            просто и не требует больших затрат.
                        </p>
                    </div>
                    <div class="desc" :class="{'hide-mobile': !advantages}">
                        <span></span>
                        <h3 class="title-desc">
                            Теплосбережение,<br>
                            звукоизоляция и<br>
                            благоприятные микроклимат
                        </h3>
                        <p>
                            За счёт использования современных технологий строительства и лучших строительных материалов
                            обеспечивается снижение тепловых потерь и экономия потребления энергии. Структура материала
                            стен обеспечивает высокую звукоизоляцию внутренних помещений здания. Одновременно с этим
                            блоки, из которых строится таунхаус, имеют пористую структуру, что обеспечивает естественную
                            циркуляцию водяного пара через стены. Тем самым устанавливается сбалансированное соотношение
                            температуры и влажности воздуха, которые являются определяющими элементами внутреннего
                            климата.
                        </p>
                    </div>
                </div>
            </div>
        </div>
        <div class="container">
            <div class="row">
                <p class="advantages" @click="showAdvantages" v-show="!advantages">Все преимущества</p>
            </div>
        </div>
        <div class="container content-price">
            <div class="row">
                <h2 id="plains">Варианты планировок и стоимости:</h2>
                <v-carousel :cycle="false" class="carouser-hide-mobile">
                    <v-carousel-item>
                        <div class="block-text" id="photo">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide"></span>
                        </div>
                    </v-carousel-item>
                    <v-carousel-item>
                        <div class="block-text">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide2"></span>
                        </div>
                    </v-carousel-item>
                </v-carousel>

                <v-carousel :cycle="false" class="carouser-show-mobile">
                    <v-carousel-item>
                        <div class="block-text">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide-mobile"></span>
                        </div>
                    </v-carousel-item>
                    <v-carousel-item>
                        <div class="block-text">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide-mobile2"></span>
                        </div>
                    </v-carousel-item>
                    <v-carousel-item>
                        <div class="block-text">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide-mobile3"></span>
                        </div>
                    </v-carousel-item>
                    <v-carousel-item>
                        <div class="block-text">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide-mobile4"></span>
                        </div>
                    </v-carousel-item>
                    <v-carousel-item>
                        <div class="block-text">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide-mobile5"></span>
                        </div>
                    </v-carousel-item>
                    <v-carousel-item>
                        <div class="block-text">
                            <p>«Комфорт» 149.10 кв. метров, 5 комнат, участок земли, гараж, торцевое расположение блок секции, южная сторона дома.</p>
                            <p>Стоимость без отделки от 4 990 000 рублей.</p>
                            <span class="slide-mobile6"></span>
                        </div>
                    </v-carousel-item>
                </v-carousel>
            </div>
        </div>
    </div>
</template>

<script>
  export default {
    data () {
      return {
        advantages: false
      }
    },
    methods: {
      showAdvantages () {
        this.advantages = true
      }
    }
  }
</script>

<style scoped>

</style>
